FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1768/CodeRed2/include/LPC1764.h
#define PINSEL6 (*(volatile unsigned long *)0x4002C018)
#define PINSEL6_OFFSET 0x18

#define PINSEL7 (*(volatile unsigned long *)0x4002C01C)
#define PINSEL7_OFFSET 0x1C
#define PINSEL7_P3_25_MASK 0xC0000
#define PINSEL7_P3_25_BIT 18
#define PINSEL7_P3_26_MASK 0x300000
#define PINSEL7_P3_26_BIT 20

#define PINSEL8 (*(volatile unsigned long *)0x4002C020)
#define PINSEL8_OFFSET 0x20

#define PINSEL9 (*(volatile unsigned long *)0x4002C024)
#define PINSEL9_OFFSET 0x24
#define PINSEL9_P4_28_MASK 0x3000000
#define PINSEL9_P4_28_BIT 24
#define PINSEL9_P4_29_MASK 0xC000000
#define PINSEL9_P4_29_BIT 26

#define PINSEL10 (*(volatile unsigned long *)0x4002C028)
#define PINSEL10_OFFSET 0x28
#define PINSEL10_GPIO_TRACE_MASK 0x8
#define PINSEL10_GPIO_TRACE 0x8
#define PINSEL10_GPIO_TRACE_BIT 3

#define PINMODE0 (*(volatile unsigned long *)0x4002C040)
#define PINMODE0_OFFSET 0x40

#define PINMODE1 (*(volatile unsigned long *)0x4002C044)
#define PINMODE1_OFFSET 0x44

#define PINMODE2 (*(volatile unsigned long *)0x4002C048)
#define PINMODE2_OFFSET 0x48

#define PINMODE3 (*(volatile unsigned long *)0x4002C04C)
#define PINMODE3_OFFSET 0x4C

#define PINMODE4 (*(volatile unsigned long *)0x4002C050)
#define PINMODE4_OFFSET 0x50

#define PINMODE5 (*(volatile unsigned long *)0x4002C054)
#define PINMODE5_OFFSET 0x54

#define PINMODE6 (*(volatile unsigned long *)0x4002C058)
#define PINMODE6_OFFSET 0x58

#define PINMODE7 (*(volatile unsigned long *)0x4002C05C)
#define PINMODE7_OFFSET 0x5C

#define PINMODE8 (*(volatile unsigned long *)0x4002C060)
#define PINMODE8_OFFSET 0x60

#define PINMODE9 (*(volatile unsigned long *)0x4002C064)
#define PINMODE9_OFFSET 0x64

#define PINMODE_OD0 (*(volatile unsigned long *)0x4002C068)
#define PINMODE_OD0_OFFSET 0x68
#define PINMODE_OD0_P0_0OD_MASK 0x1
#define PINMODE_OD0_P0_0OD 0x1
#define PINMODE_OD0_P0_0OD_BIT 0
#define PINMODE_OD0_P0_1OD_MASK 0x2
#define PINMODE_OD0_P0_1OD 0x2
#define PINMODE_OD0_P0_1OD_BIT 1
#define PINMODE_OD0_P0_2OD_MASK 0x4
#define PINMODE_OD0_P0_2OD 0x4
#define PINMODE_OD0_P0_2OD_BIT 2
#define PINMODE_OD0_P0_3OD_MASK 0x8
#define PINMODE_OD0_P0_3OD 0x8
#define PINMODE_OD0_P0_3OD_BIT 3
#define PINMODE_OD0_P0_4OD_MASK 0x10
#define PINMODE_OD0_P0_4OD 0x10
#define PINMODE_OD0_P0_4OD_BIT 4
#define PINMODE_OD0_P0_5OD_MASK 0x20
#define PINMODE_OD0_P0_5OD 0x20
#define PINMODE_OD0_P0_5OD_BIT 5
#define PINMODE_OD0_P0_6OD_MASK 0x40
#define PINMODE_OD0_P0_6OD 0x40
#define PINMODE_OD0_P0_6OD_BIT 6
#define PINMODE_OD0_P0_7OD_MASK 0x80
#define PINMODE_OD0_P0_7OD 0x80
#define PINMODE_OD0_P0_7OD_BIT 7
#define PINMODE_OD0_P0_8OD_MASK 0x100
#define PINMODE_OD0_P0_8OD 0x100
#define PINMODE_OD0_P0_8OD_BIT 8
#define PINMODE_OD0_P0_9OD_MASK 0x200
#define PINMODE_OD0_P0_9OD 0x200
#define PINMODE_OD0_P0_9OD_BIT 9
#define PINMODE_OD0_P0_10OD_MASK 0x400
#define PINMODE_OD0_P0_10OD 0x400
#define PINMODE_OD0_P0_10OD_BIT 10
#define PINMODE_OD0_P0_11OD_MASK 0x800
#define PINMODE_OD0_P0_11OD 0x800
#define PINMODE_OD0_P0_11OD_BIT 11
#define PINMODE_OD0_P0_12OD_MASK 0x1000
#define PINMODE_OD0_P0_12OD 0x1000
#define PINMODE_OD0_P0_12OD_BIT 12
#define PINMODE_OD0_P0_13OD_MASK 0x2000
#define PINMODE_OD0_P0_13OD 0x2000
#define PINMODE_OD0_P0_13OD_BIT 13
#define PINMODE_OD0_P0_14OD_MASK 0x4000
#define PINMODE_OD0_P0_14OD 0x4000
#define PINMODE_OD0_P0_14OD_BIT 14
#define PINMODE_OD0_P0_15OD_MASK 0x8000
#define PINMODE_OD0_P0_15OD 0x8000
#define PINMODE_OD0_P0_15OD_BIT 15
#define PINMODE_OD0_P0_16OD_MASK 0x10000
#define PINMODE_OD0_P0_16OD 0x10000
#define PINMODE_OD0_P0_16OD_BIT 16
#define PINMODE_OD0_P0_17OD_MASK 0x20000
#define PINMODE_OD0_P0_17OD 0x20000
#define PINMODE_OD0_P0_17OD_BIT 17
#define PINMODE_OD0_P0_18OD_MASK 0x40000
#define PINMODE_OD0_P0_18OD 0x40000
#define PINMODE_OD0_P0_18OD_BIT 18
#define PINMODE_OD0_P0_19OD_MASK 0x80000
#define PINMODE_OD0_P0_19OD 0x80000
#define PINMODE_OD0_P0_19OD_BIT 19
#define PINMODE_OD0_P0_20OD_MASK 0x100000
#define PINMODE_OD0_P0_20OD 0x100000
#define PINMODE_OD0_P0_20OD_BIT 20
#define PINMODE_OD0_P0_21OD_MASK 0x200000
#define PINMODE_OD0_P0_21OD 0x200000
#define PINMODE_OD0_P0_21OD_BIT 21
#define PINMODE_OD0_P0_22OD_MASK 0x400000
#define PINMODE_OD0_P0_22OD 0x400000
#define PINMODE_OD0_P0_22OD_BIT 22
#define PINMODE_OD0_P0_23OD_MASK 0x800000
#define PINMODE_OD0_P0_23OD 0x800000
#define PINMODE_OD0_P0_23OD_BIT 23
#define PINMODE_OD0_P0_24OD_MASK 0x1000000
#define PINMODE_OD0_P0_24OD 0x1000000
#define PINMODE_OD0_P0_24OD_BIT 24
#define PINMODE_OD0_P0_25OD_MASK 0x2000000
#define PINMODE_OD0_P0_25OD 0x2000000
#define PINMODE_OD0_P0_25OD_BIT 25
#define PINMODE_OD0_P0_26OD_MASK 0x4000000
#define PINMODE_OD0_P0_26OD 0x4000000
#define PINMODE_OD0_P0_26OD_BIT 26
#define PINMODE_OD0_P0_27OD_MASK 0x8000000
#define PINMODE_OD0_P0_27OD 0x8000000
#define PINMODE_OD0_P0_27OD_BIT 27
#define PINMODE_OD0_P0_28OD_MASK 0x10000000
#define PINMODE_OD0_P0_28OD 0x10000000
#define PINMODE_OD0_P0_28OD_BIT 28
#define PINMODE_OD0_P0_29OD_MASK 0x20000000
#define PINMODE_OD0_P0_29OD 0x20000000
#define PINMODE_OD0_P0_29OD_BIT 29
#define PINMODE_OD0_P0_30OD_MASK 0x40000000
#define PINMODE_OD0_P0_30OD 0x40000000
#define PINMODE_OD0_P0_30OD_BIT 30
#define PINMODE_OD0_P0_31OD_MASK 0x80000000
#define PINMODE_OD0_P0_31OD 0x80000000
#define PINMODE_OD0_P0_31OD_BIT 31

#define PINMODE_OD1 (*(volatile unsigned long *)0x4002C06C)
#define PINMODE_OD1_OFFSET 0x6C
#define PINMODE_OD1_P1_0OD_MASK 0x1
#define PINMODE_OD1_P1_0OD 0x1
#define PINMODE_OD1_P1_0OD_BIT 0
#define PINMODE_OD1_P1_1OD_MASK 0x2
#define PINMODE_OD1_P1_1OD 0x2
#define PINMODE_OD1_P1_1OD_BIT 1
#define PINMODE_OD1_P1_2OD_MASK 0x4
#define PINMODE_OD1_P1_2OD 0x4
#define PINMODE_OD1_P1_2OD_BIT 2
#define PINMODE_OD1_P1_3OD_MASK 0x8
#define PINMODE_OD1_P1_3OD 0x8
#define PINMODE_OD1_P1_3OD_BIT 3
#define PINMODE_OD1_P1_4OD_MASK 0x10
#define PINMODE_OD1_P1_4OD 0x10
#define PINMODE_OD1_P1_4OD_BIT 4
#define PINMODE_OD1_P1_5OD_MASK 0x20
#define PINMODE_OD1_P1_5OD 0x20
#define PINMODE_OD1_P1_5OD_BIT 5
#define PINMODE_OD1_P1_6OD_MASK 0x40
#define PINMODE_OD1_P1_6OD 0x40
#define PINMODE_OD1_P1_6OD_BIT 6
#define PINMODE_OD1_P1_7OD_MASK 0x80
#define PINMODE_OD1_P1_7OD 0x80
#define PINMODE_OD1_P1_7OD_BIT 7
#define PINMODE_OD1_P1_8OD_MASK 0x100
#define PINMODE_OD1_P1_8OD 0x100
#define PINMODE_OD1_P1_8OD_BIT 8
#define PINMODE_OD1_P1_9OD_MASK 0x200
#define PINMODE_OD1_P1_9OD 0x200
#define PINMODE_OD1_P1_9OD_BIT 9
#define PINMODE_OD1_P1_10OD_MASK 0x400
#define PINMODE_OD1_P1_10OD 0x400
#define PINMODE_OD1_P1_10OD_BIT 10
#define PINMODE_OD1_P1_11OD_MASK 0x800
#define PINMODE_OD1_P1_11OD 0x800
#define PINMODE_OD1_P1_11OD_BIT 11
#define PINMODE_OD1_P1_12OD_MASK 0x1000
#define PINMODE_OD1_P1_12OD 0x1000
#define PINMODE_OD1_P1_12OD_BIT 12
#define PINMODE_OD1_P1_13OD_MASK 0x2000
#define PINMODE_OD1_P1_13OD 0x2000
#define PINMODE_OD1_P1_13OD_BIT 13
#define PINMODE_OD1_P1_14OD_MASK 0x4000
#define PINMODE_OD1_P1_14OD 0x4000
#define PINMODE_OD1_P1_14OD_BIT 14
#define PINMODE_OD1_P1_15OD_MASK 0x8000
#define PINMODE_OD1_P1_15OD 0x8000
#define PINMODE_OD1_P1_15OD_BIT 15
#define PINMODE_OD1_P1_16OD_MASK 0x10000
#define PINMODE_OD1_P1_16OD 0x10000
#define PINMODE_OD1_P1_16OD_BIT 16
#define PINMODE_OD1_P1_17OD_MASK 0x20000
#define PINMODE_OD1_P1_17OD 0x20000
#define PINMODE_OD1_P1_17OD_BIT 17
#define PINMODE_OD1_P1_18OD_MASK 0x40000
#define PINMODE_OD1_P1_18OD 0x40000
#define PINMODE_OD1_P1_18OD_BIT 18
#define PINMODE_OD1_P1_19OD_MASK 0x80000
#define PINMODE_OD1_P1_19OD 0x80000
#define PINMODE_OD1_P1_19OD_BIT 19
#define PINMODE_OD1_P1_20OD_MASK 0x100000
#define PINMODE_OD1_P1_20OD 0x100000
#define PINMODE_OD1_P1_20OD_BIT 20
#define PINMODE_OD1_P1_21OD_MASK 0x200000
#define PINMODE_OD1_P1_21OD 0x200000
#define PINMODE_OD1_P1_21OD_BIT 21
#define PINMODE_OD1_P1_22OD_MASK 0x400000
#define PINMODE_OD1_P1_22OD 0x400000
#define PINMODE_OD1_P1_22OD_BIT 22
#define PINMODE_OD1_P1_23OD_MASK 0x800000
#define PINMODE_OD1_P1_23OD 0x800000
#define PINMODE_OD1_P1_23OD_BIT 23
#define PINMODE_OD1_P1_24OD_MASK 0x1000000
#define PINMODE_OD1_P1_24OD 0x1000000
#define PINMODE_OD1_P1_24OD_BIT 24
#define PINMODE_OD1_P1_25OD_MASK 0x2000000
#define PINMODE_OD1_P1_25OD 0x2000000
#define PINMODE_OD1_P1_25OD_BIT 25
#define PINMODE_OD1_P1_26OD_MASK 0x4000000
#define PINMODE_OD1_P1_26OD 0x4000000
#define PINMODE_OD1_P1_26OD_BIT 26
#define PINMODE_OD1_P1_27OD_MASK 0x8000000
#define PINMODE_OD1_P1_27OD 0x8000000
#define PINMODE_OD1_P1_27OD_BIT 27
#define PINMODE_OD1_P1_28OD_MASK 0x10000000
#define PINMODE_OD1_P1_28OD 0x10000000
#define PINMODE_OD1_P1_28OD_BIT 28
#define PINMODE_OD1_P1_29OD_MASK 0x20000000
#define PINMODE_OD1_P1_29OD 0x20000000
#define PINMODE_OD1_P1_29OD_BIT 29
#define PINMODE_OD1_P1_30OD_MASK 0x40000000
#define PINMODE_OD1_P1_30OD 0x40000000
#define PINMODE_OD1_P1_30OD_BIT 30
#define PINMODE_OD1_P1_31OD_MASK 0x80000000
#define PINMODE_OD1_P1_31OD 0x80000000
#define PINMODE_OD1_P1_31OD_BIT 31

#define PINMODE_OD2 (*(volatile unsigned long *)0x4002C070)
#define PINMODE_OD2_OFFSET 0x70
#define PINMODE_OD2_P2_0OD_MASK 0x1
#define PINMODE_OD2_P2_0OD 0x1
#define PINMODE_OD2_P2_0OD_BIT 0
#define PINMODE_OD2_P2_1OD_MASK 0x2
#define PINMODE_OD2_P2_1OD 0x2
#define PINMODE_OD2_P2_1OD_BIT 1
#define PINMODE_OD2_P2_2OD_MASK 0x4
#define PINMODE_OD2_P2_2OD 0x4
#define PINMODE_OD2_P2_2OD_BIT 2
#define PINMODE_OD2_P2_3OD_MASK 0x8
#define PINMODE_OD2_P2_3OD 0x8
#define PINMODE_OD2_P2_3OD_BIT 3
#define PINMODE_OD2_P2_4OD_MASK 0x10
#define PINMODE_OD2_P2_4OD 0x10
#define PINMODE_OD2_P2_4OD_BIT 4
#define PINMODE_OD2_P2_5OD_MASK 0x20
#define PINMODE_OD2_P2_5OD 0x20
#define PINMODE_OD2_P2_5OD_BIT 5
#define PINMODE_OD2_P2_6OD_MASK 0x40
#define PINMODE_OD2_P2_6OD 0x40
#define PINMODE_OD2_P2_6OD_BIT 6
#define PINMODE_OD2_P2_7OD_MASK 0x80
#define PINMODE_OD2_P2_7OD 0x80
#define PINMODE_OD2_P2_7OD_BIT 7
#define PINMODE_OD2_P2_8OD_MASK 0x100
#define PINMODE_OD2_P2_8OD 0x100
#define PINMODE_OD2_P2_8OD_BIT 8
#define PINMODE_OD2_P2_9OD_MASK 0x200
#define PINMODE_OD2_P2_9OD 0x200
#define PINMODE_OD2_P2_9OD_BIT 9
#define PINMODE_OD2_P2_10OD_MASK 0x400
#define PINMODE_OD2_P2_10OD 0x400
#define PINMODE_OD2_P2_10OD_BIT 10
#define PINMODE_OD2_P2_11OD_MASK 0x800
#define PINMODE_OD2_P2_11OD 0x800
#define PINMODE_OD2_P2_11OD_BIT 11
#define PINMODE_OD2_P2_12OD_MASK 0x1000
#define PINMODE_OD2_P2_12OD 0x1000
#define PINMODE_OD2_P2_12OD_BIT 12
#define PINMODE_OD2_P2_13OD_MASK 0x2000
#define PINMODE_OD2_P2_13OD 0x2000
#define PINMODE_OD2_P2_13OD_BIT 13
#define PINMODE_OD2_P2_14OD_MASK 0x4000
#define PINMODE_OD2_P2_14OD 0x4000
#define PINMODE_OD2_P2_14OD_BIT 14
#define PINMODE_OD2_P2_15OD_MASK 0x8000
#define PINMODE_OD2_P2_15OD 0x8000
#define PINMODE_OD2_P2_15OD_BIT 15
#define PINMODE_OD2_P2_16OD_MASK 0x10000
#define PINMODE_OD2_P2_16OD 0x10000
#define PINMODE_OD2_P2_16OD_BIT 16
#define PINMODE_OD2_P2_17OD_MASK 0x20000
#define PINMODE_OD2_P2_17OD 0x20000
#define PINMODE_OD2_P2_17OD_BIT 17
#define PINMODE_OD2_P2_18OD_MASK 0x40000
#define PINMODE_OD2_P2_18OD 0x40000
#define PINMODE_OD2_P2_18OD_BIT 18
#define PINMODE_OD2_P2_19OD_MASK 0x80000
#define PINMODE_OD2_P2_19OD 0x80000
#define PINMODE_OD2_P2_19OD_BIT 19
#define PINMODE_OD2_P2_20OD_MASK 0x100000
#define PINMODE_OD2_P2_20OD 0x100000
#define PINMODE_OD2_P2_20OD_BIT 20
#define PINMODE_OD2_P2_21OD_MASK 0x200000
#define PINMODE_OD2_P2_21OD 0x200000
#define PINMODE_OD2_P2_21OD_BIT 21
#define PINMODE_OD2_P2_22OD_MASK 0x400000
#define PINMODE_OD2_P2_22OD 0x400000
#define PINMODE_OD2_P2_22OD_BIT 22
#define PINMODE_OD2_P2_23OD_MASK 0x800000
#define PINMODE_OD2_P2_23OD 0x800000
#define PINMODE_OD2_P2_23OD_BIT 23
#define PINMODE_OD2_P2_24OD_MASK 0x1000000
#define PINMODE_OD2_P2_24OD 0x1000000
#define PINMODE_OD2_P2_24OD_BIT 24
#define PINMODE_OD2_P2_25OD_MASK 0x2000000
#define PINMODE_OD2_P2_25OD 0x2000000
#define PINMODE_OD2_P2_25OD_BIT 25
#define PINMODE_OD2_P2_26OD_MASK 0x4000000
#define PINMODE_OD2_P2_26OD 0x4000000
#define PINMODE_OD2_P2_26OD_BIT 26
#define PINMODE_OD2_P2_27OD_MASK 0x8000000
#define PINMODE_OD2_P2_27OD 0x8000000
#define PINMODE_OD2_P2_27OD_BIT 27
#define PINMODE_OD2_P2_28OD_MASK 0x10000000
#define PINMODE_OD2_P2_28OD 0x10000000
#define PINMODE_OD2_P2_28OD_BIT 28
#define PINMODE_OD2_P2_29OD_MASK 0x20000000
#define PINMODE_OD2_P2_29OD 0x20000000
#define PINMODE_OD2_P2_29OD_BIT 29
#define PINMODE_OD2_P2_30OD_MASK 0x40000000
#define PINMODE_OD2_P2_30OD 0x40000000
#define PINMODE_OD2_P2_30OD_BIT 30
#define PINMODE_OD2_P2_31OD_MASK 0x80000000
#define PINMODE_OD2_P2_31OD 0x80000000
#define PINMODE_OD2_P2_31OD_BIT 31

