FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1768/CodeRed2/include/LPC1764.h
#define QEICONF (*(volatile unsigned long *)0x400BC008)
#define QEICONF_OFFSET 0x8
#define QEICONF_DIRINV_MASK 0x1
#define QEICONF_DIRINV 0x1
#define QEICONF_DIRINV_BIT 0
#define QEICONF_SIGMODE_MASK 0x2
#define QEICONF_SIGMODE 0x2
#define QEICONF_SIGMODE_BIT 1
#define QEICONF_CAPMODE_MASK 0x4
#define QEICONF_CAPMODE 0x4
#define QEICONF_CAPMODE_BIT 2
#define QEICONF_INVINX_MASK 0x8
#define QEICONF_INVINX 0x8
#define QEICONF_INVINX_BIT 3

#define QEIPOS (*(volatile unsigned long *)0x400BC00C)
#define QEIPOS_OFFSET 0xC

#define QEIMAXPOS (*(volatile unsigned long *)0x400BC010)
#define QEIMAXPOS_OFFSET 0x10

#define CMPOS0 (*(volatile unsigned long *)0x400BC014)
#define CMPOS0_OFFSET 0x14

#define CMPOS1 (*(volatile unsigned long *)0x400BC018)
#define CMPOS1_OFFSET 0x18

#define CMPOS2 (*(volatile unsigned long *)0x400BC01C)
#define CMPOS2_OFFSET 0x1C

#define INXCNT (*(volatile unsigned long *)0x400BC020)
#define INXCNT_OFFSET 0x20

#define INXCMP (*(volatile unsigned long *)0x400BC024)
#define INXCMP_OFFSET 0x24

#define QEILOAD (*(volatile unsigned long *)0x400BC028)
#define QEILOAD_OFFSET 0x28

#define QEITIME (*(volatile unsigned long *)0x400BC02C)
#define QEITIME_OFFSET 0x2C

#define QEIVEL (*(volatile unsigned long *)0x400BC030)
#define QEIVEL_OFFSET 0x30

#define QEICAP (*(volatile unsigned long *)0x400BC034)
#define QEICAP_OFFSET 0x34

#define VELCOMP (*(volatile unsigned long *)0x400BC038)
#define VELCOMP_OFFSET 0x38

#define FILTER (*(volatile unsigned long *)0x400BC03C)
#define FILTER_OFFSET 0x3C

#define QEIIEC (*(volatile unsigned long *)0x400BCFD8)
#define QEIIEC_OFFSET 0xFD8
#define QEIIEC_INX_EN_MASK 0x1
#define QEIIEC_INX_EN 0x1
#define QEIIEC_INX_EN_BIT 0
#define QEIIEC_TIM_EN_MASK 0x2
#define QEIIEC_TIM_EN 0x2
#define QEIIEC_TIM_EN_BIT 1
#define QEIIEC_VELC_EN_MASK 0x4
#define QEIIEC_VELC_EN 0x4
#define QEIIEC_VELC_EN_BIT 2
#define QEIIEC_DIR_EN_MASK 0x8
#define QEIIEC_DIR_EN 0x8
#define QEIIEC_DIR_EN_BIT 3
#define QEIIEC_ERR_EN_MASK 0x10
#define QEIIEC_ERR_EN 0x10
#define QEIIEC_ERR_EN_BIT 4
#define QEIIEC_ENCLK_EN_MASK 0x20
#define QEIIEC_ENCLK_EN 0x20
#define QEIIEC_ENCLK_EN_BIT 5
#define QEIIEC_POS0_EN_MASK 0x40
#define QEIIEC_POS0_EN 0x40
#define QEIIEC_POS0_EN_BIT 6
#define QEIIEC_POS1_EN_MASK 0x80
#define QEIIEC_POS1_EN 0x80
#define QEIIEC_POS1_EN_BIT 7
#define QEIIEC_POS2_EN_MASK 0x100
#define QEIIEC_POS2_EN 0x100
#define QEIIEC_POS2_EN_BIT 8
#define QEIIEC_REV_Int_MASK 0x200
#define QEIIEC_REV_Int 0x200
#define QEIIEC_REV_Int_BIT 9
#define QEIIEC_POS0REV_Int_MASK 0x400
#define QEIIEC_POS0REV_Int 0x400
#define QEIIEC_POS0REV_Int_BIT 10
#define QEIIEC_POS1REV_Int_MASK 0x800
#define QEIIEC_POS1REV_Int 0x800
#define QEIIEC_POS1REV_Int_BIT 11
#define QEIIEC_POS2REV_Int_MASK 0x1000
#define QEIIEC_POS2REV_Int 0x1000
#define QEIIEC_POS2REV_Int_BIT 12

#define QEIIES (*(volatile unsigned long *)0x400BCFDC)
#define QEIIES_OFFSET 0xFDC
#define QEIIES_INX_EN_MASK 0x1
#define QEIIES_INX_EN 0x1
#define QEIIES_INX_EN_BIT 0
#define QEIIES_TIM_EN_MASK 0x2
#define QEIIES_TIM_EN 0x2
#define QEIIES_TIM_EN_BIT 1
#define QEIIES_VELC_EN_MASK 0x4
#define QEIIES_VELC_EN 0x4
#define QEIIES_VELC_EN_BIT 2
#define QEIIES_DIR_EN_MASK 0x8
#define QEIIES_DIR_EN 0x8
#define QEIIES_DIR_EN_BIT 3
#define QEIIES_ERR_EN_MASK 0x10
#define QEIIES_ERR_EN 0x10
#define QEIIES_ERR_EN_BIT 4
#define QEIIES_ENCLK_EN_MASK 0x20
#define QEIIES_ENCLK_EN 0x20
#define QEIIES_ENCLK_EN_BIT 5
#define QEIIES_POS0_EN_MASK 0x40
#define QEIIES_POS0_EN 0x40
#define QEIIES_POS0_EN_BIT 6
#define QEIIES_POS1_EN_MASK 0x80
#define QEIIES_POS1_EN 0x80
#define QEIIES_POS1_EN_BIT 7
#define QEIIES_POS2_EN_MASK 0x100
#define QEIIES_POS2_EN 0x100
#define QEIIES_POS2_EN_BIT 8
#define QEIIES_REV_Int_MASK 0x200
#define QEIIES_REV_Int 0x200
#define QEIIES_REV_Int_BIT 9
#define QEIIES_POS0REV_Int_MASK 0x400
#define QEIIES_POS0REV_Int 0x400
#define QEIIES_POS0REV_Int_BIT 10
#define QEIIES_POS1REV_Int_MASK 0x800
#define QEIIES_POS1REV_Int 0x800
#define QEIIES_POS1REV_Int_BIT 11
#define QEIIES_POS2REV_Int_MASK 0x1000
#define QEIIES_POS2REV_Int 0x1000
#define QEIIES_POS2REV_Int_BIT 12

#define QEIINTSTAT (*(volatile unsigned long *)0x400BCFE0)
#define QEIINTSTAT_OFFSET 0xFE0
#define QEIINTSTAT_INX_Int_MASK 0x1
#define QEIINTSTAT_INX_Int 0x1
#define QEIINTSTAT_INX_Int_BIT 0
#define QEIINTSTAT_TIM_Int_MASK 0x2
#define QEIINTSTAT_TIM_Int 0x2
#define QEIINTSTAT_TIM_Int_BIT 1
#define QEIINTSTAT_VELC_Int_MASK 0x4
#define QEIINTSTAT_VELC_Int 0x4
#define QEIINTSTAT_VELC_Int_BIT 2
#define QEIINTSTAT_DIR_Int_MASK 0x8
#define QEIINTSTAT_DIR_Int 0x8
#define QEIINTSTAT_DIR_Int_BIT 3
#define QEIINTSTAT_ERR_Int_MASK 0x10
#define QEIINTSTAT_ERR_Int 0x10
#define QEIINTSTAT_ERR_Int_BIT 4
#define QEIINTSTAT_ENCLK_Int_MASK 0x20
#define QEIINTSTAT_ENCLK_Int 0x20
#define QEIINTSTAT_ENCLK_Int_BIT 5
#define QEIINTSTAT_POS0_Int_MASK 0x40
#define QEIINTSTAT_POS0_Int 0x40
#define QEIINTSTAT_POS0_Int_BIT 6
#define QEIINTSTAT_POS1_Int_MASK 0x80
#define QEIINTSTAT_POS1_Int 0x80
#define QEIINTSTAT_POS1_Int_BIT 7
#define QEIINTSTAT_POS2_Int_MASK 0x100
#define QEIINTSTAT_POS2_Int 0x100
#define QEIINTSTAT_POS2_Int_BIT 8
#define QEIINTSTAT_REV_Int_MASK 0x200
#define QEIINTSTAT_REV_Int 0x200
#define QEIINTSTAT_REV_Int_BIT 9
#define QEIINTSTAT_POS0REV_Int_MASK 0x400
#define QEIINTSTAT_POS0REV_Int 0x400
#define QEIINTSTAT_POS0REV_Int_BIT 10
#define QEIINTSTAT_POS1REV_Int_MASK 0x800
#define QEIINTSTAT_POS1REV_Int 0x800
#define QEIINTSTAT_POS1REV_Int_BIT 11
#define QEIINTSTAT_POS2REV_Int_MASK 0x1000
#define QEIINTSTAT_POS2REV_Int 0x1000
#define QEIINTSTAT_POS2REV_Int_BIT 12

#define QEIIE (*(volatile unsigned long *)0x400BCFE4)
#define QEIIE_OFFSET 0xFE4
#define QEIIE_INX_Int_MASK 0x1
#define QEIIE_INX_Int 0x1
#define QEIIE_INX_Int_BIT 0
#define QEIIE_TIM_Int_MASK 0x2
#define QEIIE_TIM_Int 0x2
#define QEIIE_TIM_Int_BIT 1
#define QEIIE_VELC_Int_MASK 0x4
#define QEIIE_VELC_Int 0x4
#define QEIIE_VELC_Int_BIT 2
#define QEIIE_DIR_Int_MASK 0x8
#define QEIIE_DIR_Int 0x8
#define QEIIE_DIR_Int_BIT 3
#define QEIIE_ERR_Int_MASK 0x10
#define QEIIE_ERR_Int 0x10
#define QEIIE_ERR_Int_BIT 4
#define QEIIE_ENCLK_Int_MASK 0x20
#define QEIIE_ENCLK_Int 0x20
#define QEIIE_ENCLK_Int_BIT 5
#define QEIIE_POS0_Int_MASK 0x40
#define QEIIE_POS0_Int 0x40
#define QEIIE_POS0_Int_BIT 6
#define QEIIE_POS1_Int_MASK 0x80
#define QEIIE_POS1_Int 0x80
#define QEIIE_POS1_Int_BIT 7
#define QEIIE_POS2_Int_MASK 0x100
#define QEIIE_POS2_Int 0x100
#define QEIIE_POS2_Int_BIT 8
#define QEIIE_REV_Int_MASK 0x200
#define QEIIE_REV_Int 0x200
#define QEIIE_REV_Int_BIT 9
#define QEIIE_POS0REV_Int_MASK 0x400
#define QEIIE_POS0REV_Int 0x400
#define QEIIE_POS0REV_Int_BIT 10
#define QEIIE_POS1REV_Int_MASK 0x800
#define QEIIE_POS1REV_Int 0x800
#define QEIIE_POS1REV_Int_BIT 11
#define QEIIE_POS2REV_Int_MASK 0x1000
#define QEIIE_POS2REV_Int 0x1000
#define QEIIE_POS2REV_Int_BIT 12

#define QEICLR (*(volatile unsigned long *)0x400BCFE8)
#define QEICLR_OFFSET 0xFE8
#define QEICLR_INX_Int_MASK 0x1
#define QEICLR_INX_Int 0x1
#define QEICLR_INX_Int_BIT 0
#define QEICLR_TIM_Int_MASK 0x2
#define QEICLR_TIM_Int 0x2
#define QEICLR_TIM_Int_BIT 1
#define QEICLR_VELC_Int_MASK 0x4
#define QEICLR_VELC_Int 0x4
#define QEICLR_VELC_Int_BIT 2
#define QEICLR_DIR_Int_MASK 0x8
#define QEICLR_DIR_Int 0x8
#define QEICLR_DIR_Int_BIT 3
#define QEICLR_ERR_Int_MASK 0x10
#define QEICLR_ERR_Int 0x10
#define QEICLR_ERR_Int_BIT 4
#define QEICLR_ENCLK_Int_MASK 0x20
#define QEICLR_ENCLK_Int 0x20
#define QEICLR_ENCLK_Int_BIT 5
#define QEICLR_POS0_Int_MASK 0x40
#define QEICLR_POS0_Int 0x40
#define QEICLR_POS0_Int_BIT 6
#define QEICLR_POS1_Int_MASK 0x80
#define QEICLR_POS1_Int 0x80
#define QEICLR_POS1_Int_BIT 7
#define QEICLR_POS2_Int_MASK 0x100
#define QEICLR_POS2_Int 0x100
#define QEICLR_POS2_Int_BIT 8
#define QEICLR_REV_Int_MASK 0x200
#define QEICLR_REV_Int 0x200
#define QEICLR_REV_Int_BIT 9
#define QEICLR_POS0REV_Int_MASK 0x400
#define QEICLR_POS0REV_Int 0x400
#define QEICLR_POS0REV_Int_BIT 10
#define QEICLR_POS1REV_Int_MASK 0x800
#define QEICLR_POS1REV_Int 0x800
#define QEICLR_POS1REV_Int_BIT 11
#define QEICLR_POS2REV_Int_MASK 0x1000
#define QEICLR_POS2REV_Int 0x1000
#define QEICLR_POS2REV_Int_BIT 12

