FutureDesigns/uEZ/uEZ/Source/Processor/NXP/LPC1768/CodeRed2/include/LPC1764.h
#define IntClear (*(volatile unsigned *)0x50000FE8)
#define IntClear_OFFSET 0xFE8
#define IntClear_RxOverrunIntClr_MASK 0x1
#define IntClear_RxOverrunIntClr 0x1
#define IntClear_RxOverrunIntClr_BIT 0
#define IntClear_RxErrorIntClr_MASK 0x2
#define IntClear_RxErrorIntClr 0x2
#define IntClear_RxErrorIntClr_BIT 1
#define IntClear_RxFinishedIntClr_MASK 0x4
#define IntClear_RxFinishedIntClr 0x4
#define IntClear_RxFinishedIntClr_BIT 2
#define IntClear_RxDoneIntClr_MASK 0x8
#define IntClear_RxDoneIntClr 0x8
#define IntClear_RxDoneIntClr_BIT 3
#define IntClear_TxUnderrunIntClr_MASK 0x10
#define IntClear_TxUnderrunIntClr 0x10
#define IntClear_TxUnderrunIntClr_BIT 4
#define IntClear_TxErrorIntClr_MASK 0x20
#define IntClear_TxErrorIntClr 0x20
#define IntClear_TxErrorIntClr_BIT 5
#define IntClear_TxFinishedIntClr_MASK 0x40
#define IntClear_TxFinishedIntClr 0x40
#define IntClear_TxFinishedIntClr_BIT 6
#define IntClear_TxDoneIntClr_MASK 0x80
#define IntClear_TxDoneIntClr 0x80
#define IntClear_TxDoneIntClr_BIT 7
#define IntClear_SoftIntClr_MASK 0x1000
#define IntClear_SoftIntClr 0x1000
#define IntClear_SoftIntClr_BIT 12
#define IntClear_WakeupIntClr_MASK 0x2000
#define IntClear_WakeupIntClr 0x2000
#define IntClear_WakeupIntClr_BIT 13

#define IntSet (*(volatile unsigned *)0x50000FEC)
#define IntSet_OFFSET 0xFEC
#define IntSet_RxOverrunIntSet_MASK 0x1
#define IntSet_RxOverrunIntSet 0x1
#define IntSet_RxOverrunIntSet_BIT 0
#define IntSet_RxErrorIntSet_MASK 0x2
#define IntSet_RxErrorIntSet 0x2
#define IntSet_RxErrorIntSet_BIT 1
#define IntSet_RxFinishedIntSet_MASK 0x4
#define IntSet_RxFinishedIntSet 0x4
#define IntSet_RxFinishedIntSet_BIT 2
#define IntSet_RxDoneIntSet_MASK 0x8
#define IntSet_RxDoneIntSet 0x8
#define IntSet_RxDoneIntSet_BIT 3
#define IntSet_TxUnderrunIntSet_MASK 0x10
#define IntSet_TxUnderrunIntSet 0x10
#define IntSet_TxUnderrunIntSet_BIT 4
#define IntSet_TxErrorIntSet_MASK 0x20
#define IntSet_TxErrorIntSet 0x20
#define IntSet_TxErrorIntSet_BIT 5
#define IntSet_TxFinishedIntSet_MASK 0x40
#define IntSet_TxFinishedIntSet 0x40
#define IntSet_TxFinishedIntSet_BIT 6
#define IntSet_TxDoneIntSet_MASK 0x80
#define IntSet_TxDoneIntSet 0x80
#define IntSet_TxDoneIntSet_BIT 7
#define IntSet_SoftIntSet_MASK 0x1000
#define IntSet_SoftIntSet 0x1000
#define IntSet_SoftIntSet_BIT 12
#define IntSet_WakeupIntSet_MASK 0x2000
#define IntSet_WakeupIntSet 0x2000
#define IntSet_WakeupIntSet_BIT 13

#define PowerDown (*(volatile unsigned *)0x50000FF4)
#define PowerDown_OFFSET 0xFF4
#define PowerDown_PowerDownMACAHB_MASK 0x80000000
#define PowerDown_PowerDownMACAHB 0x80000000
#define PowerDown_PowerDownMACAHB_BIT 31

#define GPDMA_BASE_ADDRESS 0x50004000

#define DMACIntStat (*(volatile unsigned *)0x50004000)
#define DMACIntStat_OFFSET 0x0
#define DMACIntStat_IntStat_MASK 0xFF
#define DMACIntStat_IntStat_BIT 0

#define DMACIntTCStat (*(volatile unsigned *)0x50004004)
#define DMACIntTCStat_OFFSET 0x4
#define DMACIntTCStat_IntTCStat_MASK 0xFF
#define DMACIntTCStat_IntTCStat_BIT 0

#define DMACIntTCClear (*(volatile unsigned *)0x50004008)
#define DMACIntTCClear_OFFSET 0x8
#define DMACIntTCClear_IntTCClear_MASK 0xFF
#define DMACIntTCClear_IntTCClear_BIT 0

#define DMACIntErrStat (*(volatile unsigned *)0x5000400C)
#define DMACIntErrStat_OFFSET 0xC
#define DMACIntErrStat_IntErrStat_MASK 0xFF
#define DMACIntErrStat_IntErrStat_BIT 0

#define DMACIntErrClr (*(volatile unsigned *)0x50004010)
#define DMACIntErrClr_OFFSET 0x10
#define DMACIntErrClr_IntErrClr_MASK 0xFF
#define DMACIntErrClr_IntErrClr_BIT 0

#define DMACRawIntTCStat (*(volatile unsigned *)0x50004014)
#define DMACRawIntTCStat_OFFSET 0x14
#define DMACRawIntTCStat_RawIntTCStat_MASK 0xFF
#define DMACRawIntTCStat_RawIntTCStat_BIT 0

#define DMACRawIntErrStat (*(volatile unsigned *)0x50004018)
#define DMACRawIntErrStat_OFFSET 0x18
#define DMACRawIntErrStat_RawIntErrStat_MASK 0xFF
#define DMACRawIntErrStat_RawIntErrStat_BIT 0

#define DMACEnbldChns (*(volatile unsigned *)0x5000401C)
#define DMACEnbldChns_OFFSET 0x1C
#define DMACEnbldChns_EnabledChannels_MASK 0xFF
#define DMACEnbldChns_EnabledChannels_BIT 0

#define DMACSoftBReq (*(volatile unsigned *)0x50004020)
#define DMACSoftBReq_OFFSET 0x20
#define DMACSoftBReq_SoftBReq_MASK 0xFFFF
#define DMACSoftBReq_SoftBReq_BIT 0

#define DMACSoftSReq (*(volatile unsigned *)0x50004024)
#define DMACSoftSReq_OFFSET 0x24
#define DMACSoftSReq_SoftSReq_MASK 0xFFFF
#define DMACSoftSReq_SoftSReq_BIT 0

#define DMACSoftLBReq (*(volatile unsigned *)0x50004028)
#define DMACSoftLBReq_OFFSET 0x28
#define DMACSoftLBReq_SoftLBReq_MASK 0xFFFF
#define DMACSoftLBReq_SoftLBReq_BIT 0

#define DMACSoftLSReq (*(volatile unsigned *)0x5000402C)
#define DMACSoftLSReq_OFFSET 0x2C
#define DMACSoftLSReq_SoftLSReq_MASK 0xFFFF
#define DMACSoftLSReq_SoftLSReq_BIT 0

#define DMACConfig (*(volatile unsigned *)0x50004030)
#define DMACConfig_OFFSET 0x30
#define DMACConfig_E_MASK 0x1
#define DMACConfig_E 0x1
#define DMACConfig_E_BIT 0
#define DMACConfig_M_MASK 0x2
#define DMACConfig_M 0x2
#define DMACConfig_M_BIT 1

#define DMACSync (*(volatile unsigned *)0x50004034)
#define DMACSync_OFFSET 0x34
#define DMACSync_DMACSync_MASK 0xFFFF
#define DMACSync_DMACSync_BIT 0

#define DMACC0SrcAddr (*(volatile unsigned *)0x50004100)
#define DMACC0SrcAddr_OFFSET 0x100

#define DMACC1SrcAddr (*(volatile unsigned *)0x50004120)
#define DMACC1SrcAddr_OFFSET 0x120

#define DMACC2SrcAddr (*(volatile unsigned *)0x50004140)
#define DMACC2SrcAddr_OFFSET 0x140

#define DMACC3SrcAddr (*(volatile unsigned *)0x50004160)
#define DMACC3SrcAddr_OFFSET 0x160

#define DMACC4SrcAddr (*(volatile unsigned *)0x50004180)
#define DMACC4SrcAddr_OFFSET 0x180

#define DMACC5SrcAddr (*(volatile unsigned *)0x500041A0)
#define DMACC5SrcAddr_OFFSET 0x1A0

#define DMACC6SrcAddr (*(volatile unsigned *)0x500041C0)
#define DMACC6SrcAddr_OFFSET 0x1C0

#define DMACC7SrcAddr (*(volatile unsigned *)0x500041E0)
#define DMACC7SrcAddr_OFFSET 0x1E0

#define DMACC0DestAddr (*(volatile unsigned *)0x50004104)
#define DMACC0DestAddr_OFFSET 0x104

#define DMACC1DestAddr (*(volatile unsigned *)0x50004124)
#define DMACC1DestAddr_OFFSET 0x124

#define DMACC2DestAddr (*(volatile unsigned *)0x50004144)
#define DMACC2DestAddr_OFFSET 0x144

#define DMACC3DestAddr (*(volatile unsigned *)0x50004164)
#define DMACC3DestAddr_OFFSET 0x164

#define DMACC4DestAddr (*(volatile unsigned *)0x50004184)
#define DMACC4DestAddr_OFFSET 0x184

#define DMACC5DestAddr (*(volatile unsigned *)0x500041A4)
#define DMACC5DestAddr_OFFSET 0x1A4

#define DMACC6DestAddr (*(volatile unsigned *)0x500041C4)
#define DMACC6DestAddr_OFFSET 0x1C4

#define DMACC7DestAddr (*(volatile unsigned *)0x500041E4)
#define DMACC7DestAddr_OFFSET 0x1E4

